In [11]:
import numpy as np
import pandas as pd

In [2]:
vecotr_row = np.array([1, 2, 3])

In [6]:
vecotr_row

array([1, 2, 3])

In [9]:
vecotr_col = np.array([[1],
                       [2],
                       [3]])

In [10]:
vecotr_col

array([[1],
       [2],
       [3]])

##  資料整理

In [13]:
url = 'https://tinyurl.com/titanic-csv'
dataframe = pd.read_csv(url)

In [22]:
dataframe.head(5) ## head -> 前五個

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [24]:
dataframe.shape # (rows,  col)

(1313, 6)

In [26]:
dataframe.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

## linear regression

In [28]:
from sklearn.linear_model import LinearRegression
from sklearn.datasets import load_boston

In [32]:
boston = load_boston()
features = boston.data[:, 0:2]
target = boston.target

In [39]:
regression = LinearRegression()
model = regression.fit(features, target)

In [40]:
model.intercept_

22.485628113468223